; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite2 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	spectrograph0 - mode
	image1 - mode
	Star13 - direction
	Star10 - direction
	Star12 - direction
	Star2 - direction
	Star8 - direction
	GroundStation14 - direction
	GroundStation4 - direction
	GroundStation9 - direction
	GroundStation1 - direction
	Star0 - direction
	Star11 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	GroundStation3 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image1)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation14)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 GroundStation14)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star6)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet19)
	(supports instrument4 spectrograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star12)
	(calibration_target instrument4 Star0)
	(supports instrument5 image1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star11)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star8)
	(supports instrument6 image1)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation14)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation9)
	(calibration_target instrument7 Star0)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(on_board instrument7 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star21)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 Star7)
	(supports instrument9 image1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 GroundStation3)
	(calibration_target instrument9 GroundStation5)
	(calibration_target instrument9 Star11)
	(calibration_target instrument9 Star0)
	(supports instrument10 image1)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 Star7)
	(calibration_target instrument10 Star6)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(on_board instrument10 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation14)
)
(:goal (and
	(pointing satellite1 Star13)
	(pointing satellite2 Star13)
	(have_image Planet15 image1)
	(have_image Planet16 image1)
	(have_image Phenomenon17 image1)
	(have_image Planet18 image1)
	(have_image Planet19 image1)
	(have_image Phenomenon20 spectrograph0)
	(have_image Star21 image1)
))

)

; plan
1. (turn_to satellite1 star13 star21)
   deleted: (pointing satellite1 star21)
   added: (pointing satellite1 star13)
   goals met: 1 of 9
2. (turn_to satellite0 groundstation14 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 groundstation14)
   goals met: 1 of 9
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 9
4. (calibrate satellite0 instrument2 groundstation14)
   added: (calibrated instrument2)
   goals met: 1 of 9
5. (turn_to satellite0 planet15 groundstation14)
   deleted: (pointing satellite0 groundstation14)
   added: (pointing satellite0 planet15)
   goals met: 1 of 9
6. (take_image satellite0 planet15 instrument2 image1)
   added: (have_image planet15 image1)
   goals met: 2 of 9
7. (turn_to satellite0 phenomenon20 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon20)
   goals met: 2 of 9
8. (take_image satellite0 phenomenon20 instrument2 spectrograph0)
   added: (have_image phenomenon20 spectrograph0)
   goals met: 3 of 9
9. (turn_to satellite0 phenomenon17 phenomenon20)
   deleted: (pointing satellite0 phenomenon20)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 9
10. (take_image satellite0 phenomenon17 instrument2 image1)
   added: (have_image phenomenon17 image1)
   goals met: 4 of 9
11. (turn_to satellite0 planet16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet16)
   goals met: 4 of 9
12. (take_image satellite0 planet16 instrument2 image1)
   added: (have_image planet16 image1)
   goals met: 5 of 9
13. (turn_to satellite0 planet18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet18)
   goals met: 5 of 9
14. (take_image satellite0 planet18 instrument2 image1)
   added: (have_image planet18 image1)
   goals met: 6 of 9
15. (turn_to satellite0 planet19 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet19)
   goals met: 6 of 9
16. (take_image satellite0 planet19 instrument2 image1)
   added: (have_image planet19 image1)
   goals met: 7 of 9
17. (turn_to satellite0 star21 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 star21)
   goals met: 7 of 9
18. (take_image satellite0 star21 instrument2 image1)
   added: (have_image star21 image1)
   goals met: 8 of 9
19. (turn_to satellite2 star13 groundstation14)
   deleted: (pointing satellite2 groundstation14)
   added: (pointing satellite2 star13)
   goals met: 9 of 9
